############### Mensajes generales ############### 
access.denied=Acceso denegado
notResults=No se encontraron resultados a la consulta.
notResultsAdd=No se encontraron usuarios para asignar al supervisor
notResultsRemove=Este supervisor no tiene usuarios asignados
notResultsSupervisor=Este usuario no tiene supervisor asignado
fillFields=Rellene los campos de b&uacute;squeda para realizar la consulta
############### Mensajes de validacion ###################
errors.allfields.required=Debe llenar todos los campos
errors.required=El campo {0} es requerido.
errors.upload.image=Muy grande 
errors.invalid=El valor del campo {0} no es v&aacute;lido.
errors.maxlength=El campo {0} no puede exceder {1} caracteres.
errors.minlength=El campo {0} no puede contener menos de {1} caracteres.
errors.range={0}, {1} rango de fechas no valido.
errors.email={0} no es un correo v&aacute;lido.
errors.required.fields=Campos obligatorios vacios.



errors.byte={0} must be an byte.
errors.date={0} is not a date.
errors.double={0} must be an double.
errors.float={0} must be an float.
errors.integer={0} must be an integer.
errors.long={0} must be an long.
errors.short=El campo {0} debe ser un numero entero.<BR>
errors.creditcard={0} is not a valid credit card number.
errors.image.sizeExceed=Tama&ntilde;o de la imagen excede el m&aacute;ximo configurado (250KB).

errors.notmatch.password=Contrase&ntilde;a actual no coincide.
errors.notequal.password=Nueva Contrase&ntilde;a y Confirmaci&oacute;n de Nueva Contrase&ntilde;a no coinciden.
errors.notmatch.email=El correo que introdujo no corresponde al usuario registrado
errors.notexist.login=El usuario invalido
############### Mensajes de Error generales #######################
errors=Ha ocurrido un error al intentar realizar la operaci&oacute;n, por favor intente mas tarde.
errors.add=Ha ocurrido un error al intentar realizar la operaci&oacute;n de inserci&oacute;n.
errors.update=Ha ocurrido un error al intentar realizar la operaci&oacute;n de modificaci&oacute;n.
errors.delete=Ha ocurrido un error al intentar realizar la operaci&oacute;n de eliminaci&oacute;n.
errors.search=Disculpe, ha ocurrido un error al realizar la b&uacute;squeda. Intente luego.
#errors.search=Disculpe, debe seleccionar un vendedor para realizar la b&uacute;squeda.
errors.searchSalesman=Disculpe, debe seleccionar un vendedor y una empresa para realizar la b&uacute;squeda.
errors.load=Disculpe, ha ocurrido un error en la carga de la pagina. Intente luego.


############### Errores EN AUTENTICACION #######################
errors.auth=No se logr&oacute; realizar la autenticaci&oacute;n, por favor intente luego.
errors.auth.invalid=Usuario o password no valido.
errors.session.expired=La sesi&oacute;n ha expirado.


############### MENSAJES DE EXITO (CRUD)############### 
#- INSERT -#
success.insert.device=El dispositivo ha sido agregado exitosamente.
success.insert.role=El rol ha sido insertado exitosamente.
success.insert.user=El usuario ha sido agregado exitosamente.
success.insert.notification=El destinatario de notificaci&oacute;n ha sido modificado exitosamente.
success.insert.incidence_type=La actividad ha sido agregada exitosamente.
success.insert.incidence_motive=El evento ha sido agregado exitosamente.
success.insert.return_type=El tipo de devoluci&oacute;n ha sido agregado exitosamente.
success.insert.return_motive=El motivo de devoluci&oacute;n ha sido agregado exitosamente.
success.insert.supervisor=Los supervisados han sido asignados correctamente.

#- UPDATE -#
success.update.device=El dispositivo ha sido modificado exitosamente.
success.update.role=El rol ha sido modificado exitosamente.
success.update.user=El usuario ha sido modificado exitosamente.
success.update.notification=El destinatario de notificaci&oacute;n ha sido modificado exitosamente.
success.update.password=El password fue actualizado exitosamente.
success.reset.password=Le hemos enviado un correo con una nueva contrase&ntilde;a. <BR><BR>Si despu&eacute;s de probar la nueva contrase&ntilde;a no logra ingresar al sistema, comun&iacute;quese con el administrador.
success.update.incidence_type=La actividad ha sido modificada exitosamente.
success.update.incidence_motive=El evento ha sido modificado exitosamente.
success.update.return_type=El tipo de devoluci&oacute;n ha sido modificado exitosamente.
success.update.return_motive=El motivo de devoluci&oacute;n ha sido modificado exitosamente.

#- DELETE -#
success.delete.device=El dispositivo ha sido eliminado exitosamente.
success.delete.role=El rol ha sido eliminado exitosamente.
success.delete.user=El usuario ha sido eliminado exitosamente.
success.delete.notification=El destinatario de notificaci&oacute;n ha sido eliminado exitosamente.
success.delete.incidence_type=La actividad ha sido eliminada exitosamente.
success.delete.incidence_motive=El evento ha sido eliminado exitosamente.
success.delete.return_type=El tipo de devoluci&oacute;n ha sido eliminado exitosamente.
success.delete.return_motive=El motivo de devoluci&oacute;n ha sido eliminado exitosamente.
success.delete.supervisor=Se han removido los supervisados correctamente.


success.email.send=La notificaci&oacute;n ha sido reenviada.

##################### MENSAJES DE ERROR (CRUD) #####################################
#- INSERT -#
errors.insert.device=Ocurri&oacute; un error al tratar de registrar un nuevo dispositivo, por favor intente luego.
errors.insert.role=Ocurri&oacute; un error al tratar de registrar un nuevo rol, por favor intente luego.
errors.insert.user=Ocurri&oacute; un error al tratar de registrar un nuevo usuario, por favor intente luego.
errors.insert.incidence_motive=Ocurri&oacute; un error al tratar de registrar un evento, por favor intente luego.
errors.insert.incidence_type=Ocurri&oacute; un error al tratar de registrar una actividad, por favor intente luego.
errors.insert.return_type=Ocurri&oacute; un error al tratar de registrar un tipo de devoluci&oacute;n, por favor intente luego.
errors.insert.return_motive=Ocurri&oacute; un error al tratar de registrar un motivo de devoluci&oacute;n, por favor intente luego.
errors.insert.notification=Ocurri&oacute; un error al tratar de registrar una nueva notificaci&oacute;n, por favor intente luego.
errors.insert.null.incidence_type=Debe introducir el nombre de la actividad
errors.insert.null.incidence_motive=Debe introducir el nombre del evento
errors.insert.null.return_type=Debe introducir el nombre del tipo de devoluci&oacute;n
errors.insert.null.return_motive=Debe introducir el nombre del motivo de devoluci&oacute;n
errors.insert.supervisor=Debe seleccionar usuarios para realizar esta operaci&oacute;n.


#- UPDATE -#
errors.update.device=Ocurri&oacute; un error al tratar de modificar el dispositivo, por favor intente luego.
errors.update.role=Ocurri&oacute; un error al tratar de modificar el rol, por favor intente luego.
errors.update.user=Ocurri&oacute; un error al tratar de modificar el usuario, por favor intente luego.
errors.update.notification=Ocurri&oacute; un error al tratar de modificar la notificaci&oacute;n, por favor intente luego.
errors.update.password=Ocurri&oacute; un error al tratar de actualizar el password, por favor intente luego.
errors.update.password.mail=El password fue actualizado exitosamente, pero Ocurri&oacute; un error al enviar el email de notificaci&oacute;n.
errors.update.incidence_type=Ocurri&oacute; un error al tratar de actualizar la actividad, por favor intente luego.
errors.update.incidence_motive=Ocurri&oacute; un error al tratar de actualizar el evento, por favor intente luego.
errors.update.return_type=Ocurri&oacute; un error al tratar de actualizar el tipo de devoluci&oacute;n, por favor intente luego.
errors.update.return_motive=Ocurri&oacute; un error al tratar de actualizar el motivo de devoluci&oacute;n, por favor intente luego.
success.reset.password=Se ha generado una nueva contrase&ntilde;a. 
success.reset.password.userMessage=Si despu&eacute;s de probar la nueva contrase&ntilde;a no logra ingresar al sistema, comun&iacute;quese con el administrador.

#- DELETE -#
errors.delete.device=Ocurri&oacute; un error al tratar de modificar el dispositivo, por favor intente luego.
errors.delete.role=Ocurri&oacute; un error al tratar de modificar el rol, por favor intente luego.
errors.delete.user=Ocurri&oacute; un error al tratar de modificar el usuario, por favor intente luego.
errors.delete.notification=Ocurri&oacute; un error al tratar de modificar la notificaci&oacute;n, por favor intente luego.
errors.delete.incidence_type=Ocurri&oacute; un error al tratar de eliminar la actividad, por favor intente luego.
errors.delete.incidence_motive=Ocurri&oacute; un error al tratar de eliminar el evento, por favor intente luego.
errors.delete.return_type=Ocurri&oacute; un error al tratar de eliminar el tipo de devoluci&oacute;n, por favor intente luego.
errors.delete.return_motive=Ocurri&oacute; un error al tratar de eliminar el motivo de devoluci&oacute;n, por favor intente luego.


errors.duplicate.login=El login ingresado se encuentra asignado a otro usuario 
errors.device.duplicate=No se ha registrado el dispositivo. C&oacute;digo de dispositivo ya existe

errors.email.send=Ocurri&oacute; un error al tratar de reenviar la notificaci&oacute;n.

#- VISITS AND ITINERAY -#
errors.insert.itinerary=Ha ocurrido un error en la carga del itinerario
errors.exist.itinerary=Las visitas creadas como "Inválida" ya se encuentran registradas en el sistema.
success.insert.visit.itinerary=¡Carga Exitosa!
errors.order.not.valid=El valor del campo orden no es v&aacute;lido
errors.no.visit.saved=Ninguna visita para el periodo de tiempo especificado.
success.insert.visit=La visita ha sido agregada exitosamente.
errors.insert.visit=Ocurri&oacute; un error al tratar de registrar una nueva visita, por favor intente luego.
success.delete.visit= La(s) visita(s) ha sido eliminada(s) exitosamente.
errors.delete.visit=Debe seleccionar una(s) visita para eliminarla.
errors.range.date=Rango de fechas no v&aacute;lido.
errors.exist.client.visit= Ya el cliente tiene una visita creada para ese d&iacute;a
errors.exist.order.visit=Ya existe una visita creada para ese orden, por favor seleccione otro orden.